<template>
  <el-card>
    <h1 slot="header">服务节点的发布</h1>
    <h2>1，发布流程</h2>
    <p>1.1 在需发布的服务节点所在集群编辑发布方案。</p>
    <p>1.2 在节点管理中注册节点，并设定相应的版本号。 </p>
    <p>1.3 将新上线的服务节点设为启用。 </p>
    <p>1.4 节点测试完成后在服务集群的版本管理中将新版本号设为正式版本。</p>
    <h2>2，发布说明</h2>
    <p>2.1 同集群相同类目的服务节点正式版本号唯一。</p>
    <p>2.2 各服务节点之间调用，按照正式版本号进行隔离访问（不是正式版本号的节点不会被其它正式版本节点发现）。</p>
    <p>2.3 非正式版本节点要被其它节点访问时需要通过"发布方案"编辑节点之间版本关系。</p>
  </el-card>
</template>
<script>
export default {
  components: {},
  data() {
    return {}
  },
  mounted() {},
  methods: {}
}
</script>
